[
    {
        "text": "Jordan Duhe has been an excellent, over the top attorney. She's decicated to her job and her clients. I felt I was in good hands the moment I sat down and started explaining my situation. She's straightforward and honest. That's the beauty behind her and her work. No BS. I would recommend her to anyone who's dealing with the courts and needs legal help and advice.",
        "name": "John Day",
        "date": "",
        "start": true
    },{
        "text": "Had the most troubling situation after a speeding ticket while heading to vacation in Myrtle Beach. In my search for help I stumbled upon Duhe Willets Law, and I MUST say that Jordan was beyond professional, helpful, & attentive. To going out of her way, with fast responding emails, Straight to the point answers and helpful solutions. To even responding at later then work hour emails. She was extremely helpful and managed to help me get my situation fixed as quick as possible! I am beyond thankful and hoping not to need to contact her again but will absolutely, if I’m ever in a bubble again!",
        "name": "Bryhan Andrade",
        "date": ""
    },{
        "text": "Jordan Duhe did excellent job and kept us informed.  I would recommend them to friends and family.  Thanks again.",
        "name": "Barney McClure",
        "date": ""
    },{
        "text": "A very good attorney. Personable and knowledgeable.",
        "name": "Harry Pridgen",
        "date": ""
    },{
        "text": "I was fortunate to have had Jordan Duhe represent me. She provided excellent legal advice and care, in addition to being very compassionate. I would highly recommend others to pursue her services if they are seeking professional legal representation. You will be in very good hands, as I was.",
        "name": "Eric Thee",
        "date": ""
    },{
        "text": "Jordan is amazing, if you want a very dedicated lawyer that Will without a doubt be the most known around soon well here she is. She took the worst decision/day of my life and made it as easy going as possible. Not to mention the END RESULT, she is amazing and I feel indebted to her for the level of dedication and determination she showed.",
        "name": "Randall Beam",
        "date": ""
    },{
        "text": "Hardworking, dedicated, personable, and very reasonable. Hands down the best attorney I could’ve ever asked for! Took the worst situation of my life and turned it around to the best, and gave me another chance in life, so appreciative and thankful to of came in contact!! Thank you so much again!!!!",
        "name": "Chris Chafin",
        "date": ""
    }
]